; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v10 ?v5)
             (pred_12 ?v8 ?v3)
             (pred_1 ?v10 ?v3)
             (pred_4 ?v2 ?v10 )
	     (pred_9 ?v10)
             (pred_2 ?v7)
             (pred_5 ?v8)
             (pred_11 ?v3)
             (pred_7 ?v10)
             (pred_10 ?v8)
             (pred_8 ?v10)
             (pred_6 ))



(:action op_4
:parameters (?v6 ?v9 ?v11 ?v13)
:precondition (and (pred_2 ?v6) (pred_2 ?v9) (pred_5 ?v11) (pred_11 ?v13)
          (pred_3 ?v6 ?v9) (pred_12 ?v11 ?v13)
                   (pred_1 ?v9 ?v13) (pred_9 ?v6) 
                   (pred_7 ?v9) (pred_10 ?v11))
:effect (and  (pred_8 ?v9) (not (pred_7 ?v9))))


(:action op_2
:parameters (?v6 ?v12)
:precondition (and (pred_2 ?v6) (pred_2 ?v12)
               (pred_9 ?v6) (pred_3 ?v6 ?v12) (pred_8 ?v12))
:effect (and (pred_9 ?v12) (not (pred_9 ?v6))))

(:action op_3
:parameters (?v6 ?v11)
:precondition (and (pred_2 ?v6) (pred_5 ?v11) 
                  (pred_9 ?v6) (pred_4 ?v11 ?v6) (pred_6 ))
:effect (and (pred_10 ?v11)
   (not (pred_4 ?v11 ?v6)) (not (pred_6 ))))


(:action op_1
:parameters (?v6 ?v4 ?v1)
:precondition (and (pred_2 ?v6) (pred_5 ?v4) (pred_5 ?v1)
                  (pred_9 ?v6) (pred_10 ?v1) (pred_4 ?v4 ?v6))
:effect (and (pred_10 ?v4) (pred_4 ?v1 ?v6)
        (not (pred_10 ?v1)) (not (pred_4 ?v4 ?v6))))

(:action op_5
:parameters (?v6 ?v11)
:precondition (and (pred_2 ?v6) (pred_5 ?v11) 
                  (pred_9 ?v6) (pred_10 ?v11))
:effect (and (pred_6 ) (pred_4 ?v11 ?v6) (not (pred_10 ?v11)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_07 obj_16 obj_21 obj_09 obj_20 obj_10 obj_02 obj_15 obj_14 obj_17 obj_19 obj_01 obj_04 obj_08 obj_12 obj_11
    obj_05 obj_03
    obj_18 obj_13 obj_06
    )

    (:init
       (pred_6)

       (pred_2 obj_07)
       (pred_2 obj_16)
       (pred_2 obj_21)
       (pred_2 obj_09)
       (pred_2 obj_20)
       (pred_2 obj_10)
       (pred_2 obj_02)
       (pred_2 obj_15)
       (pred_2 obj_14)
       (pred_2 obj_17)
       (pred_2 obj_19)
       (pred_2 obj_01)
       (pred_2 obj_04)
       (pred_2 obj_08)
       (pred_2 obj_12)
       (pred_2 obj_11)
       (pred_11 obj_05)
       (pred_11 obj_03)
       (pred_5 obj_18)
       (pred_5 obj_13)
       (pred_5 obj_06)

       (pred_3 obj_07 obj_20)
       (pred_3 obj_07 obj_16)
       (pred_3 obj_16 obj_10)
       (pred_3 obj_16 obj_21)
       (pred_3 obj_16 obj_07)
       (pred_3 obj_21 obj_02)
       (pred_3 obj_21 obj_09)
       (pred_3 obj_21 obj_16)
       (pred_3 obj_09 obj_15)
       (pred_3 obj_09 obj_21)
       (pred_3 obj_20 obj_14)
       (pred_3 obj_20 obj_10)
       (pred_3 obj_20 obj_07)
       (pred_3 obj_10 obj_17)
       (pred_3 obj_10 obj_02)
       (pred_3 obj_10 obj_16)
       (pred_3 obj_10 obj_20)
       (pred_3 obj_02 obj_19)
       (pred_3 obj_02 obj_15)
       (pred_3 obj_02 obj_21)
       (pred_3 obj_02 obj_10)
       (pred_3 obj_15 obj_01)
       (pred_3 obj_15 obj_09)
       (pred_3 obj_15 obj_02)
       (pred_3 obj_14 obj_04)
       (pred_3 obj_14 obj_17)
       (pred_3 obj_14 obj_20)
       (pred_3 obj_17 obj_08)
       (pred_3 obj_17 obj_19)
       (pred_3 obj_17 obj_10)
       (pred_3 obj_17 obj_14)
       (pred_3 obj_19 obj_12)
       (pred_3 obj_19 obj_01)
       (pred_3 obj_19 obj_02)
       (pred_3 obj_19 obj_17)
       (pred_3 obj_01 obj_11)
       (pred_3 obj_01 obj_15)
       (pred_3 obj_01 obj_19)
       (pred_3 obj_04 obj_08)
       (pred_3 obj_04 obj_14)
       (pred_3 obj_08 obj_12)
       (pred_3 obj_08 obj_17)
       (pred_3 obj_08 obj_04)
       (pred_3 obj_12 obj_11)
       (pred_3 obj_12 obj_19)
       (pred_3 obj_12 obj_08)
       (pred_3 obj_11 obj_01)
       (pred_3 obj_11 obj_12)
       (pred_7 obj_20)
       (pred_7 obj_01)
       (pred_7 obj_02)
       (pred_1  obj_20 obj_05)
       (pred_1  obj_01 obj_03)
       (pred_1  obj_02 obj_03)
       (pred_8 obj_07)
       (pred_8 obj_16)
       (pred_8 obj_21)
       (pred_8 obj_09)
       (pred_8 obj_10)
       (pred_8 obj_15)
       (pred_8 obj_14)
       (pred_8 obj_17)
       (pred_8 obj_19)
       (pred_8 obj_04)
       (pred_8 obj_08)
       (pred_8 obj_12)
       (pred_8 obj_11)

       (pred_12  obj_18 obj_05)
       (pred_12  obj_13 obj_03)
       (pred_12  obj_06 obj_05)
       (pred_4 obj_18 obj_15)
       (pred_4 obj_13 obj_09)
       (pred_4 obj_06 obj_11)
       (pred_9 obj_07)
    )

    (:goal (and
       (pred_4 obj_18 obj_09)
       (pred_4 obj_06 obj_09)
    ))
(:constraints
  (always (not (pred_9 obj_01)))
)
)

; plan
1. (op_2 obj_07 obj_16)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_16)
   goals met: 0 of 2
2. (op_2 obj_16 obj_21)
   deleted: (pred_9 obj_16)
   added: (pred_9 obj_21)
   goals met: 0 of 2
3. (op_2 obj_21 obj_09)
   deleted: (pred_9 obj_21)
   added: (pred_9 obj_09)
   goals met: 0 of 2
4. (op_2 obj_09 obj_15)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_15)
   goals met: 0 of 2
5. (op_3 obj_15 obj_18)
   deleted: (pred_4 obj_18 obj_15) (pred_6)
   added: (pred_10 obj_18)
   goals met: 0 of 2
6. (op_2 obj_15 obj_09)
   deleted: (pred_9 obj_15)
   added: (pred_9 obj_09)
   goals met: 0 of 2
7. (op_1 obj_09 obj_13 obj_18)
   deleted: (pred_10 obj_18) (pred_4 obj_13 obj_09)
   added: (pred_10 obj_13) (pred_4 obj_18 obj_09)
   goals met: 1 of 2
8. (op_2 obj_09 obj_15)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_15)
   goals met: 1 of 2
9. (op_4 obj_15 obj_01 obj_13 obj_03)
   deleted: (pred_7 obj_01)
   added: (pred_8 obj_01)
   goals met: 1 of 2
10. (op_4 obj_15 obj_02 obj_13 obj_03)
   deleted: (pred_7 obj_02)
   added: (pred_8 obj_02)
   goals met: 1 of 2
11. (op_5 obj_15 obj_13)
   deleted: (pred_10 obj_13)
   added: (pred_6) (pred_4 obj_13 obj_15)
   goals met: 1 of 2
12. (op_2 obj_15 obj_02)
   deleted: (pred_9 obj_15)
   added: (pred_9 obj_02)
   goals met: 1 of 2
13. (op_2 obj_02 obj_19)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_19)
   goals met: 1 of 2
14. (op_2 obj_19 obj_12)
   deleted: (pred_9 obj_19)
   added: (pred_9 obj_12)
   goals met: 1 of 2
15. (op_2 obj_12 obj_11)
   deleted: (pred_9 obj_12)
   added: (pred_9 obj_11)
   goals met: 1 of 2
16. (op_3 obj_11 obj_06)
   deleted: (pred_4 obj_06 obj_11) (pred_6)
   added: (pred_10 obj_06)
   goals met: 1 of 2
17. (op_2 obj_11 obj_12)
   deleted: (pred_9 obj_11)
   added: (pred_9 obj_12)
   goals met: 1 of 2
18. (op_2 obj_12 obj_19)
   deleted: (pred_9 obj_12)
   added: (pred_9 obj_19)
   goals met: 1 of 2
19. (op_2 obj_19 obj_02)
   deleted: (pred_9 obj_19)
   added: (pred_9 obj_02)
   goals met: 1 of 2
20. (op_2 obj_02 obj_21)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_21)
   goals met: 1 of 2
21. (op_2 obj_21 obj_09)
   deleted: (pred_9 obj_21)
   added: (pred_9 obj_09)
   goals met: 1 of 2
22. (op_5 obj_09 obj_06)
   deleted: (pred_10 obj_06)
   added: (pred_6) (pred_4 obj_06 obj_09)
   goals met: 2 of 2
